-- =========================================
-- Задания на дом по SQL
-- Студент: ФИО
-- Дата: 29.09.2026
-- =========================================

-- Задание 1. Самый дорогой товар
SELECT тип, цена FROM Товар ORDER BY цена DESC LIMIT 1;

-- Задание 2. Самый дешёвый товар
SELECT тип, цена FROM Товар ORDER BY цена ASC LIMIT 1;

-- Задание 3. Товары одной категории
SELECT тип, цена FROM Товар WHERE длительность = 60;

-- Задание 4. Поиск по названию
SELECT * FROM Товар WHERE тип LIKE '%о%';

-- Задание 5. Все заказы
SELECT * FROM Заказ;

-- Задание 6. Заказы конкретного клиента
SELECT * FROM Заказ WHERE клиент = 'Иванов Иван Иванович';

-- Задание 7. JOIN — заказы с названиями товаров
SELEct Заказ.дата, Заказ.клиент, Товар.тип, Заказ.количество FROM Заказ JOIN Товар ON Заказ.товар_id = Товар.id;

-- Задание 8. Общая сумма всех заказов
SELECT SUM(Товар.цена * Заказ.количество) FROM Заказ Join Товар ON Заказ.товар_id = Товар.id;

-- Задание 9. Количество заказов по клиентам
SELECT клиент , COUNT(id) AS кол_во_заказов FROM Заказ GROUP BY клиент;

-- Задание 10. Свой запрос
SELECT * FROM Товар WHERE фото IS NOT NULL AND фото != '';
